{
  "schema_name": "hr_email_categories",
  "schema_version": "1.0.0",
  "domain": "hr_employee_email",
  "categories": [
    {
      "name": "PTO",
      "description": "Questions or requests about paid time off, vacation, sick leave, or holidays.",
      "examples": [
        "How many PTO days do I have left this year?",
        "I’d like to request vacation from March 10–14.",
        "What is the policy for sick leave?",
        "Do we get paid on company holidays?"
      ]
    },
    {
      "name": "Benefits",
      "description": "Benefits eligibility, enrollment, coverage details, and dependent questions.",
      "examples": [
        "How do I add my newborn to my health insurance?",
        "When is the next open enrollment period?",
        "What does our dental insurance cover?",
        "Am I eligible for vision coverage as a part-time employee?"
      ]
    },
    {
      "name": "Payroll",
      "description": "Paychecks, taxes, deductions, direct deposit, and related pay issues.",
      "examples": [
        "My paycheck amount looks lower than usual this period.",
        "How do I change my direct deposit information?",
        "Where can I find my pay stubs?",
        "Why were extra taxes taken out of my last check?"
      ]
    },
    {
      "name": "W2_and_Tax_Forms",
      "description": "W-2, 1095, and other tax documentation requests or issues.",
      "examples": [
        "Can you resend my W-2 from last year?",
        "Where do I download my W-2 form?",
        "My address was wrong on my W-2. How do I fix it?",
        "Do we receive a 1095-C form for health coverage?"
      ]
    },
    {
      "name": "HRIS_Portal_and_Access",
      "description": "Issues using the HR portal or requests for account access / troubleshooting.",
      "examples": [
        "I can’t log into the HR portal.",
        "The HR system shows the wrong manager for me.",
        "Where do I submit a PTO request in the system?",
        "My account keeps getting locked out when I sign in."
      ]
    },
    {
      "name": "Personal_Information_Changes",
      "description": "Requests to update personal or employment information in HR records.",
      "examples": [
        "I need to update my home address.",
        "How do I change my legal name after marriage?",
        "Can you update my emergency contact?",
        "My marital status changed; what do I need to do?"
      ]
    },
    {
      "name": "Employment_Verification_and_Letters",
      "description": "Employment verification, proof of income, and official letter requests.",
      "examples": [
        "I need an employment verification letter for my mortgage.",
        "Can you confirm my salary for an apartment application?",
        "How do I request a letter confirming my job title?",
        "My lender sent an employment verification form—where should I send it?"
      ]
    },
    {
      "name": "Policy_and_General_HR_Info",
      "description": "Questions about HR policies, handbooks, and general HR rules.",
      "examples": [
        "What is the company policy on remote work?",
        "Where can I find the employee handbook?",
        "What is our dress code policy?",
        "How does the performance review process work?"
      ]
    },
    {
      "name": "Leave_of_Absence",
      "description": "FMLA, parental leave, medical leave, and other extended leave topics.",
      "examples": [
        "How do I apply for maternity leave?",
        "Am I eligible for FMLA?",
        "What documentation is needed for a medical leave?",
        "How long can I be out on leave and keep my benefits?"
      ]
    },
    {
      "name": "Onboarding_and_Offboarding",
      "description": "New hire, transfer, and termination/exit logistics.",
      "examples": [
        "I haven’t received my onboarding paperwork.",
        "What should I do with my equipment when I leave?",
        "Is there a checklist for my first day?",
        "I’m transferring to another department; what changes for me?"
      ]
    },
    {
      "name": "Timekeeping_and_Scheduling",
      "description": "Timesheets, clock-in/out problems, schedules, and shift changes.",
      "examples": [
        "I forgot to clock out yesterday—how do I fix it?",
        "My timesheet won’t submit in the system.",
        "How do I see my work schedule for next week?",
        "Who do I contact to change my regular shift?"
      ]
    },
    {
      "name": "Employee_Relations_and_Concerns",
      "description": "Sensitive issues, workplace concerns, conflicts, or complaints.",
      "examples": [
        "I have a concern about how my manager is treating me.",
        "I’d like to report a potential harassment issue.",
        "What is the process for filing a formal complaint?",
          "Who do I talk to about a conflict with a coworker?"
      ]
    },
    {
      "name": "Compliance_and_Required_Training",
      "description": "Mandatory trainings, certifications, and compliance-related questions.",
      "examples": [
        "I received a notice about overdue compliance training.",
        "How do I access the harassment prevention course?",
        "Is this security training mandatory?",
        "Do I get paid for required training time?"
      ]
    },
    {
      "name": "Other_or_Not_Classified",
      "description": "HR-relevant emails that don’t clearly fit any other category.",
      "examples": [
        "I’m not sure who to contact about this issue.",
        "General HR question that doesn’t match the listed topics.",
        "Can you point me to the right HR contact?",
        "Miscellaneous questions that are still HR-related."
      ]
    }
  ]
}
